# Importing the Libraries

In [638]:
import pandas as pd
import numpy as np

# Loading our Dataset

In [639]:
geo = None
tel_1 = None
tel_2 = None
tel_3 = None
geo = pd.read_csv('cells_geo.csv', delimiter=';')
tel_1 = pd.read_csv('Telcom_dataset1.csv')
tel_2 = pd.read_csv('Telcom_dataset2.csv')
tel_3 = pd.read_csv('Telcom_dataset3.csv')

In [640]:
geo.head()

   Unnamed: 0   VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0           0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

In [641]:
tel_1.head()

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [642]:
tel_2

     PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0        sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1      Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2        sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3      Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4        sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO
...      ...    ...                    ...  ...       ...         ...         ...
4996     sms      0  2012-05-08 00:01:53.0  ...     19e2e  896459aace  b7d00e59e4
4997     sms     25  2012-05-08 00:01:53.0  ...     19e2e  7e90b35166  211015b14d
4998     sms      0  2012-05-08 00:01:53.0  ...     19e2e  fe70e431df  c7ea989264
4999    data      0  2012-05-08 00:01:53.0  ...     OTHER  ffa6759bb2         NaN
5000   Voice      0  2012-05-08 00:01:53.0  ...     19e2e  8630058aca  b47a998a3e

[5001 rows x 10 columns]

In [643]:
tel_3.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

# Data Understanding

In [644]:
tel_1.shape

(5001, 10)

In [645]:
tel_2.shape

(5001, 10)

In [646]:
tel_3.shape

(5001, 10)

In [647]:
geo.shape

(3974, 12)

In [648]:
tel_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUTC          5001 non-null   object
 1   VALUE            5001 non-null   int64
 2   DATETIME         5001 non-null   object
 3   CELL_ON_SITE     5001 non-null   object
 4   DW_A_NUMBER_INT  5001 non-null   object
 5   DW_B_NUMBER_INT  5001 non-null   object
 6   COUNTRY_A        5001 non-null   object
 7   COUNTRY_B        5001 non-null   object
 8   CELL_ID          5001 non-null   object
 9   SITE_ID          4285 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [649]:
tel_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PRODUCT       5001 non-null   object
 1   VALUE         5001 non-null   int64
 2   DATE_TIME     5001 non-null   object
 3   CELL_ON_SITE  5001 non-null   object
 4   DW_A_NUMBER   5001 non-null   object
 5   DW_B_NUMBER   5001 non-null   object
 6   COUNTRY_A     5001 non-null   object
 7   COUNTRY_B     5001 non-null   object
 8   CELL_ID       5001 non-null   object
 9   SITE_ID       4325 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [650]:
tel_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          5001 non-null   object
 1   VALUE            5001 non-null   int64
 2   DATE_TIME        5001 non-null   object
 3   CELL_ON_SITE     5001 non-null   object
 4   DW_A_NUMBER_INT  5001 non-null   object
 5   DW_B_NUMBER_INT  5001 non-null   object
 6   COUNTRY_A        5001 non-null   object
 7   COUNTRY_B        5001 non-null   object
 8   CELLID           5001 non-null   object
 9   SIET_ID          4396 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [651]:
geo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3974 entries, 0 to 3973
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    3974 non-null   int64
 1   VILLES        3974 non-null   object
 2   STATUS        3907 non-null   object
 3   LOCALISATION  3974 non-null   object
 4   DECOUPZONE    3974 non-null   object
 5   ZONENAME      3968 non-null   object
 6   LONGITUDE     3974 non-null   float64
 7   LATITUDE      3974 non-null   float64
 8   REGION        3974 non-null   object
 9   AREA          3951 non-null   object
 10  CELL_ID       3974 non-null   object
 11  SITE_CODE     3974 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 372.7+ KB

In [652]:
tel_1.isnull().sum()

PRODUTC              0
VALUE                0
DATETIME             0
CELL_ON_SITE         0
DW_A_NUMBER_INT      0
DW_B_NUMBER_INT      0
COUNTRY_A            0
COUNTRY_B            0
CELL_ID              0
SITE_ID            716
dtype: int64

In [653]:
tel_2.isnull().sum()

PRODUCT           0
VALUE             0
DATE_TIME         0
CELL_ON_SITE      0
DW_A_NUMBER       0
DW_B_NUMBER       0
COUNTRY_A         0
COUNTRY_B         0
CELL_ID           0
SITE_ID         676
dtype: int64

In [654]:
tel_3.isnull().sum()

PRODUCT              0
VALUE                0
DATE_TIME            0
CELL_ON_SITE         0
DW_A_NUMBER_INT      0
DW_B_NUMBER_INT      0
COUNTRY_A            0
COUNTRY_B            0
CELLID               0
SIET_ID            605
dtype: int64

In [655]:
geo.isnull().sum()

Unnamed: 0       0
VILLES           0
STATUS          67
LOCALISATION     0
DECOUPZONE       0
ZONENAME         6
LONGITUDE        0
LATITUDE         0
REGION           0
AREA            23
CELL_ID          0
SITE_CODE        0
dtype: int64

In [656]:
print(f'Number of duplicate rows in geo : {geo.duplicated().sum()}')
print(f'Number of duplicate rows in tel_1 : {tel_1.duplicated().sum()}')
print(f'Number of duplicate rows in tel_2 : {tel_2.duplicated().sum()}')
print(f'Number of duplicate rows in tel_3 : {tel_3.duplicated().sum()}')

Number of duplicate rows in geo : 0
Number of duplicate rows in tel_1 : 82
Number of duplicate rows in tel_2 : 78
Number of duplicate rows in tel_3 : 93

# Data Preperation

## Renaming columns

In [657]:
tel_1.columns

Index(['PRODUTC', 'VALUE', 'DATETIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [658]:
tel_1.rename(columns = {'PRODUTC':'PRODUCT', 'DATETIME':'DATA_TIME'}, inplace=True)

In [659]:
tel_2.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER',
       'DW_B_NUMBER', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [660]:
tel_2.rename(columns = {'DW_A_NUMBER':'DW_A_NUMBER_INT', 'DW_B_NUMBER':'DW_B_NUMBER_INT' }, inplace=True)

In [661]:
tel_3.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELLID', 'SIET_ID'],
      dtype='object')

In [662]:
tel_3.rename(columns = {'CELLID':'CELL_ID', 'SIET_ID':'SITE_ID'}, inplace=True)

In [663]:
# geo.columns

In [664]:
tel_1.columns

Index(['PRODUCT', 'VALUE', 'DATA_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [665]:
tel_2.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [666]:
tel_3.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [667]:
tel_3.dtypes

PRODUCT            object
VALUE               int64
DATE_TIME          object
CELL_ON_SITE       object
DW_A_NUMBER_INT    object
DW_B_NUMBER_INT    object
COUNTRY_A          object
COUNTRY_B          object
CELL_ID            object
SITE_ID            object
dtype: object

## Remove the column 'Unnamed: 0'

In [668]:
geo.columns

Index(['Unnamed: 0', 'VILLES', 'STATUS', 'LOCALISATION', 'DECOUPZONE',
       'ZONENAME', 'LONGITUDE', 'LATITUDE', 'REGION', 'AREA', 'CELL_ID',
       'SITE_CODE'],
      dtype='object')

In [669]:
try:
  geo.drop('Unnamed: 0', axis=1, inplace=True )
except:
  print('Done!')

## Remove column 'CELL_ON_SITE', 'COUNTRY_A' and 'COUNTRY_B'

In [670]:
try:
  tel_1.drop('CELL_ON_SITE', axis=1, inplace=True)
  tel_1.drop('COUNTRY_A', axis=1, inplace=True)
  tel_1.drop('COUNTRY_B', axis=1, inplace=True)

  tel_2.drop('CELL_ON_SITE', axis=1, inplace=True)
  tel_2.drop('COUNTRY_A', axis=1, inplace=True)
  tel_2.drop('COUNTRY_B', axis=1, inplace=True)

  tel_3.drop('CELL_ON_SITE', axis=1, inplace=True)
  tel_3.drop('COUNTRY_A', axis=1, inplace=True)
  tel_3.drop('COUNTRY_B', axis=1, inplace=True)
except:
  print('Done!')

## Removing Duplicate values

In [671]:
print(f'Number of duplicate rows in geo : {geo.duplicated().sum()}')
print(f'Number of duplicate rows in tel_1 : {tel_1.duplicated().sum()}')
print(f'Number of duplicate rows in tel_2 : {tel_2.duplicated().sum()}')
print(f'Number of duplicate rows in tel_3 : {tel_3.duplicated().sum()}')

Number of duplicate rows in geo : 43
Number of duplicate rows in tel_1 : 82
Number of duplicate rows in tel_2 : 78
Number of duplicate rows in tel_3 : 93

In [672]:
# displays the duplicated rows in "tel_1"
tel_1.loc[tel_1.duplicated(), :]

     PRODUCT  VALUE  ...     CELL_ID     SITE_ID
793      sms      0  ...  23c5372bd3  e942f32a29
794      sms     25  ...  a6606f4ac1  c6400e443f
814    Voice      0  ...  4a7047f1ba  dea1e52d3b
819    Voice     22  ...  9c4c7ceb92  a07e8af2b4
948      sms      0  ...  9f847444ba  c07a544c63
...      ...    ...  ...         ...         ...
4793    data      0  ...  ffa6759bb2         NaN
4863   Voice      0  ...  17ba194a62  6049499424
4864   Voice   1610  ...  89b82605a0  5324bc6c24
4943   Voice      0  ...  d6abb7e15f  f72cd95f00
4970   Voice     60  ...  fd754bd0d0  e82c07d996

[82 rows x 7 columns]

In [673]:
tel_1.drop_duplicates(keep='first')

     PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0      Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1        sms      0  ...  /+cKZKIp41  /+cKZKIp41
2        sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3      Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3
4      Voice     14  ...  051KhYDCpv  051KhYDCpv
...      ...    ...  ...         ...         ...
4996     sms    100  ...  0c2371d9bc  1e751d08a4
4997   Voice      1  ...  5fb791cf56  65efe2bc62
4998   Voice      0  ...  7773627c12  9ef9616350
4999   Voice      0  ...  3f4af49d6c  969b8d0e39
5000   Voice      7  ...  6f4d9b77a5  ebfc58af70

[4919 rows x 7 columns]

In [674]:
tel_2.drop_duplicates(keep='first')

     PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0        sms      0  ...  +854AcBQT2  +854AcBQT2
1      Voice      0  ...  +854AcBQT2  +854AcBQT2
2        sms      0  ...  +laSrk7g6q  +laSrk7g6q
3      Voice     37  ...  /xvRrCVKoQ  /xvRrCVKoQ
4        sms     25  ...  +bO+qkSonO  +bO+qkSonO
...      ...    ...  ...         ...         ...
4995     sms     25  ...  0e8763bdaa  eefd93f0b4
4996     sms      0  ...  896459aace  b7d00e59e4
4997     sms     25  ...  7e90b35166  211015b14d
4998     sms      0  ...  fe70e431df  c7ea989264
4999    data      0  ...  ffa6759bb2         NaN

[4923 rows x 7 columns]

In [675]:
tel_3.drop_duplicates(keep='first')

     PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0      Voice     61  ...  +38u2u/rfx  +38u2u/rfx
1        sms      0  ...  +Fs4mTvdKx  +Fs4mTvdKx
2      Voice     10  ...  +ZaaZozy/+  +ZaaZozy/+
3        sms      0  ...  +cNeJzsTp3  +cNeJzsTp3
4      Voice     22  ...  /eeMklgyJA  /eeMklgyJA
...      ...    ...  ...         ...         ...
4995   Voice     10  ...  6467daa1db  8a96bae9c1
4996   Voice      0  ...  2aa04dcab7  f7d63a29e5
4997   Voice     62  ...  7f1f2f889f  b4ddb9e93c
4999   Voice     30  ...  98ed726da2  b4130b54ab
5000   Voice     60  ...  1c11a2fcbb  6d70dae094

[4908 rows x 7 columns]

In [676]:
geo = geo.SITE_CODE.drop_duplicates(keep='first')

## Concatenate "tel_1", "tel_2" and "tel_3"

In [677]:
tel = pd.concat((tel_1, tel_2, tel_3), axis=0, ignore_index=True)
tel

      PRODUCT  VALUE  ...     SITE_ID              DATE_TIME
0       Voice      0  ...  /TJNe+Mmtu                    NaN
1         sms      0  ...  /+cKZKIp41                    NaN
2         sms     25  ...  /u0FSD+ahi                    NaN
3       Voice     56  ...  +cNeJzsTp3                    NaN
4       Voice     14  ...  051KhYDCpv                    NaN
...       ...    ...  ...         ...                    ...
14998   Voice      0  ...  f7d63a29e5  2012-05-09 00:01:43.0
14999   Voice     62  ...  b4ddb9e93c  2012-05-09 00:01:43.0
15000   Voice     32  ...  d68260ef50  2012-05-09 00:01:43.0
15001   Voice     30  ...  b4130b54ab  2012-05-09 00:01:43.0
15002   Voice     60  ...  6d70dae094  2012-05-09 00:01:43.0

[15003 rows x 8 columns]

## Mergeing "tel" with geo

In [678]:
tel.columns

Index(['PRODUCT', 'VALUE', 'DATA_TIME', 'DW_A_NUMBER_INT', 'DW_B_NUMBER_INT',
       'CELL_ID', 'SITE_ID', 'DATE_TIME'],
      dtype='object')

In [679]:
# geo.columns

In [680]:
tel_geo = pd.merge(tel, geo, how='inner', left_on='SITE_ID' , right_on='SITE_CODE', validate="m:1")
tel_geo.isnull().sum()

PRODUCT               0
VALUE                 0
DATA_TIME          7007
DW_A_NUMBER_INT       0
DW_B_NUMBER_INT       0
CELL_ID               0
SITE_ID               0
DATE_TIME          3441
SITE_CODE             0
dtype: int64

# Analyz

In [630]:
tel_geo['DATE_TIME'] = pd.to_datetime(tel_geo['DATA_TIME'])

In [631]:
tel_geo['DATE_TIME']
tel_geo.dtypes

PRODUCT                    object
VALUE                       int64
DATA_TIME                  object
DW_A_NUMBER_INT            object
DW_B_NUMBER_INT            object
CELL_ID                    object
SITE_ID                    object
DATE_TIME          datetime64[ns]
SITE_CODE                  object
dtype: object

In [632]:
# working day
date = ( tel_geo['DATA_TIME'] < '8-am')
date_1 = ( tel_geo['DATA_TIME'] > '5-pm')
tel_geo[date & date_1]

Empty DataFrame
Columns: [PRODUCT, VALUE, DATA_TIME, DW_A_NUMBER_INT, DW_B_NUMBER_INT, CELL_ID, SITE_ID, DATE_TIME, SITE_CODE]
Index: []

In [634]:
tel_geo['DATA_TIME'] = pd.to_datetime((tel_geo['DATA_TIME']))
tel_geo = pd.DataFrame(x, columns=['DATA_TIME'])
tel_geo.DATA_TIME = pd.to_datetime(tel_geo.DATA_TIME)
tel_geo

NameError: ignored

In [328]:
tel_geo.columns

Index(['PRODUCT', 'VALUE', 'DATA_TIME', 'DW_A_NUMBER_INT', 'DW_B_NUMBER_INT',
       'CELL_ID', 'SITE_ID', 'DATE_TIME', 'SITE_CODE'],
      dtype='object')

In [329]:
tel_geo.head()

  PRODUCT  VALUE  ...           DATE_TIME   SITE_CODE
0     sms      0  ... 2012-05-07 00:00:00  1b5540c02d
1   Voice     92  ... 2012-05-07 00:00:06  1b5540c02d
2     sms     25  ... 2012-05-07 00:00:21  1b5540c02d
3   Voice     16  ... 2012-05-07 00:00:21  1b5540c02d
4   Voice     35  ... 2012-05-07 00:00:41  1b5540c02d

[5 rows x 9 columns]